; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-8-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-4 - location
	p0-5 - location
	p0-7 - location
	p1-5 - location
	p1-8 - location
	p2-1 - location
	p3-4 - location
	p3-6 - location
	p5-2 - location
	p5-4 - location
	p6-1 - location
	p6-9 - location
	p7-2 - location
	p7-3 - location
	p8-0 - location
	p8-7 - location
	p9-2 - location
	p9-4 - location
	p9-10 - location
	p10-2 - location
	p10-7 - location
	)
	(:init
	(at driver1 s10)
	(at driver2 s5)
	(at driver3 s8)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s7)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at truck7 s5)
	(empty truck7)
	(at truck8 s7)
	(empty truck8)
	(at package1 s8)
	(at package2 s9)
	(at package3 s3)
	(at package4 s7)
	(at package5 s3)
	(at package6 s0)
	(at package7 s1)
	(at package8 s10)
	(at package9 s2)
	(at package10 s1)
	(at package11 s4)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 3)
	(= (time-to-walk p0-4 s0) 3)
	(= (time-to-walk s4 p0-4) 96)
	(= (time-to-walk p0-4 s4) 96)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 16)
	(= (time-to-walk p0-5 s0) 16)
	(= (time-to-walk s5 p0-5) 89)
	(= (time-to-walk p0-5 s5) 89)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 26)
	(= (time-to-walk p0-7 s0) 26)
	(= (time-to-walk s7 p0-7) 22)
	(= (time-to-walk p0-7 s7) 22)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 51)
	(= (time-to-walk p1-5 s1) 51)
	(= (time-to-walk s5 p1-5) 93)
	(= (time-to-walk p1-5 s5) 93)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 41)
	(= (time-to-walk p1-8 s1) 41)
	(= (time-to-walk s8 p1-8) 79)
	(= (time-to-walk p1-8 s8) 79)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 25)
	(= (time-to-walk p2-1 s2) 25)
	(= (time-to-walk s1 p2-1) 12)
	(= (time-to-walk p2-1 s1) 12)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 16)
	(= (time-to-walk p3-4 s3) 16)
	(= (time-to-walk s4 p3-4) 30)
	(= (time-to-walk p3-4 s4) 30)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 3)
	(= (time-to-walk p3-6 s3) 3)
	(= (time-to-walk s6 p3-6) 91)
	(= (time-to-walk p3-6 s6) 91)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 40)
	(= (time-to-walk p5-2 s5) 40)
	(= (time-to-walk s2 p5-2) 65)
	(= (time-to-walk p5-2 s2) 65)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 39)
	(= (time-to-walk p5-4 s5) 39)
	(= (time-to-walk s4 p5-4) 33)
	(= (time-to-walk p5-4 s4) 33)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 78)
	(= (time-to-walk p6-1 s6) 78)
	(= (time-to-walk s1 p6-1) 6)
	(= (time-to-walk p6-1 s1) 6)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 53)
	(= (time-to-walk p6-9 s6) 53)
	(= (time-to-walk s9 p6-9) 42)
	(= (time-to-walk p6-9 s9) 42)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 48)
	(= (time-to-walk p7-2 s7) 48)
	(= (time-to-walk s2 p7-2) 65)
	(= (time-to-walk p7-2 s2) 65)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 75)
	(= (time-to-walk p7-3 s7) 75)
	(= (time-to-walk s3 p7-3) 58)
	(= (time-to-walk p7-3 s3) 58)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(= (time-to-walk s8 p8-0) 10)
	(= (time-to-walk p8-0 s8) 10)
	(= (time-to-walk s0 p8-0) 88)
	(= (time-to-walk p8-0 s0) 88)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(= (time-to-walk s8 p8-7) 85)
	(= (time-to-walk p8-7 s8) 85)
	(= (time-to-walk s7 p8-7) 12)
	(= (time-to-walk p8-7 s7) 12)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(= (time-to-walk s9 p9-2) 84)
	(= (time-to-walk p9-2 s9) 84)
	(= (time-to-walk s2 p9-2) 100)
	(= (time-to-walk p9-2 s2) 100)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(= (time-to-walk s9 p9-4) 1)
	(= (time-to-walk p9-4 s9) 1)
	(= (time-to-walk s4 p9-4) 9)
	(= (time-to-walk p9-4 s4) 9)
	(path s9 p9-10)
	(path p9-10 s9)
	(path s10 p9-10)
	(path p9-10 s10)
	(= (time-to-walk s9 p9-10) 22)
	(= (time-to-walk p9-10 s9) 22)
	(= (time-to-walk s10 p9-10) 52)
	(= (time-to-walk p9-10 s10) 52)
	(path s10 p10-2)
	(path p10-2 s10)
	(path s2 p10-2)
	(path p10-2 s2)
	(= (time-to-walk s10 p10-2) 1)
	(= (time-to-walk p10-2 s10) 1)
	(= (time-to-walk s2 p10-2) 62)
	(= (time-to-walk p10-2 s2) 62)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(= (time-to-walk s10 p10-7) 31)
	(= (time-to-walk p10-7 s10) 31)
	(= (time-to-walk s7 p10-7) 26)
	(= (time-to-walk p10-7 s7) 26)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 74)
	(= (time-to-drive s2 s0) 74)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 46)
	(= (time-to-drive s5 s0) 46)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 56)
	(= (time-to-drive s6 s0) 56)
	(link s0 s10)
	(link s10 s0)
	(= (time-to-drive s0 s10) 76)
	(= (time-to-drive s10 s0) 76)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 36)
	(= (time-to-drive s2 s1) 36)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 95)
	(= (time-to-drive s3 s1) 95)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 41)
	(= (time-to-drive s4 s1) 41)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 75)
	(= (time-to-drive s7 s1) 75)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 28)
	(= (time-to-drive s9 s3) 28)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 18)
	(= (time-to-drive s0 s4) 18)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 80)
	(= (time-to-drive s2 s4) 80)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 81)
	(= (time-to-drive s5 s4) 81)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 60)
	(= (time-to-drive s6 s4) 60)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 28)
	(= (time-to-drive s1 s5) 28)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 46)
	(= (time-to-drive s3 s5) 46)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 35)
	(= (time-to-drive s8 s5) 35)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 86)
	(= (time-to-drive s9 s6) 86)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 55)
	(= (time-to-drive s2 s7) 55)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 22)
	(= (time-to-drive s1 s9) 22)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 70)
	(= (time-to-drive s2 s9) 70)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 67)
	(= (time-to-drive s4 s9) 67)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 5)
	(= (time-to-drive s8 s9) 5)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 70)
	(= (time-to-drive s10 s9) 70)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 68)
	(= (time-to-drive s2 s10) 68)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 14)
	(= (time-to-drive s6 s10) 14)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 91)
	(= (time-to-drive s8 s10) 91)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s3)
	(at truck1 s8)
	(at truck2 s7)
	(at truck3 s0)
	(at truck5 s7)
	(at truck7 s8)
	(at truck8 s7)
	(at package1 s1)
	(at package2 s9)
	(at package3 s0)
	(at package4 s2)
	(at package5 s7)
	(at package6 s9)
	(at package7 s6)
	(at package8 s1)
	(at package9 s7)
	(at package10 s3)
	(at package11 s1)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 18
2. (walk driver3 s8 p1-8)
   deleted: (at driver3 s8)
   added: (at driver3 p1-8)
   changed: (walked) from 0 to 79
   goals met: 3 of 18
3. (drive-truck truck3 s5 s3 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (driven) from 0 to 46
   goals met: 3 of 18
4. (load-truck package3 truck3 s3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 3 of 18
5. (load-truck package5 truck3 s3)
   deleted: (at package5 s3)
   added: (in package5 truck3)
   goals met: 3 of 18
6. (drive-truck truck3 s3 s5 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 46 to 92
   goals met: 3 of 18
7. (drive-truck truck3 s5 s0 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (driven) from 92 to 138
   goals met: 4 of 18
8. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   goals met: 5 of 18
9. (load-truck package6 truck3 s0)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 5 of 18
10. (walk driver3 p1-8 s1)
   deleted: (at driver3 p1-8)
   added: (at driver3 s1)
   changed: (walked) from 79 to 120
   goals met: 5 of 18
11. (drive-truck truck3 s0 s2 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 138 to 212
   goals met: 4 of 18
12. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 4 of 18
13. (load-truck package9 truck3 s2)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   goals met: 4 of 18
14. (load-truck package10 truck1 s1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 4 of 18
15. (drive-truck truck1 s1 s5 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 212 to 240
   goals met: 4 of 18
16. (drive-truck truck1 s5 s8 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   changed: (driven) from 240 to 275
   goals met: 5 of 18
17. (load-truck package1 truck1 s8)
   deleted: (at package1 s8)
   added: (in package1 truck1)
   goals met: 5 of 18
18. (drive-truck truck3 s2 s9 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (driven) from 275 to 345
   goals met: 5 of 18
19. (unload-truck package6 truck3 s9)
   deleted: (in package6 truck3)
   added: (at package6 s9)
   goals met: 6 of 18
20. (drive-truck truck3 s9 s4 driver2)
   deleted: (at truck3 s9)
   added: (at truck3 s4)
   changed: (driven) from 345 to 412
   goals met: 6 of 18
21. (load-truck package11 truck3 s4)
   deleted: (at package11 s4)
   added: (in package11 truck3)
   goals met: 6 of 18
22. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 412 to 492
   goals met: 6 of 18
23. (drive-truck truck1 s8 s5 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (driven) from 492 to 527
   goals met: 5 of 18
24. (drive-truck truck1 s5 s3 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 527 to 573
   goals met: 5 of 18
25. (unload-truck package10 truck1 s3)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 6 of 18
26. (drive-truck truck3 s2 s7 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   changed: (driven) from 573 to 628
   goals met: 6 of 18
27. (unload-truck package9 truck3 s7)
   deleted: (in package9 truck3)
   added: (at package9 s7)
   goals met: 7 of 18
28. (unload-truck package5 truck3 s7)
   deleted: (in package5 truck3)
   added: (at package5 s7)
   goals met: 8 of 18
29. (load-truck package4 truck3 s7)
   deleted: (at package4 s7)
   added: (in package4 truck3)
   goals met: 8 of 18
30. (drive-truck truck3 s7 s2 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (driven) from 628 to 683
   goals met: 8 of 18
31. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   goals met: 9 of 18
32. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 683 to 719
   goals met: 9 of 18
33. (unload-truck package11 truck3 s1)
   deleted: (in package11 truck3)
   added: (at package11 s1)
   goals met: 10 of 18
34. (drive-truck truck1 s3 s1 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 719 to 814
   goals met: 10 of 18
35. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 11 of 18
36. (drive-truck truck3 s1 s5 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 814 to 842
   goals met: 11 of 18
37. (disembark-truck driver2 truck3 s5)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 11 of 18
38. (load-truck package7 truck1 s1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   goals met: 11 of 18
39. (drive-truck truck1 s1 s9 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s9)
   changed: (driven) from 842 to 864
   goals met: 11 of 18
40. (drive-truck truck1 s9 s10 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s10)
   changed: (driven) from 864 to 934
   goals met: 11 of 18
41. (load-truck package8 truck1 s10)
   deleted: (at package8 s10)
   added: (in package8 truck1)
   goals met: 11 of 18
42. (drive-truck truck1 s10 s9 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s9)
   changed: (driven) from 934 to 1004
   goals met: 11 of 18
43. (drive-truck truck1 s9 s1 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (driven) from 1004 to 1026
   goals met: 11 of 18
44. (unload-truck package8 truck1 s1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 12 of 18
45. (drive-truck truck1 s1 s9 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s9)
   changed: (driven) from 1026 to 1048
   goals met: 12 of 18
46. (board-truck driver2 truck7 s5)
   deleted: (at driver2 s5) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 12 of 18
47. (drive-truck truck1 s9 s6 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s6)
   changed: (driven) from 1048 to 1134
   goals met: 12 of 18
48. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   goals met: 13 of 18
49. (drive-truck truck1 s6 s9 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   changed: (driven) from 1134 to 1220
   goals met: 13 of 18
50. (drive-truck truck7 s5 s8 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s8)
   changed: (driven) from 1220 to 1255
   goals met: 14 of 18
51. (drive-truck truck1 s9 s3 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s3)
   changed: (driven) from 1255 to 1283
   goals met: 14 of 18
52. (drive-truck truck1 s3 s5 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (driven) from 1283 to 1329
   goals met: 14 of 18
53. (disembark-truck driver3 truck1 s5)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 14 of 18
54. (board-truck driver3 truck6 s5)
   deleted: (at driver3 s5) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 14 of 18
55. (drive-truck truck6 s5 s3 driver3)
   deleted: (at truck6 s5)
   added: (at truck6 s3)
   changed: (driven) from 1329 to 1375
   goals met: 14 of 18
56. (drive-truck truck7 s8 s5 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s5)
   changed: (driven) from 1375 to 1410
   goals met: 13 of 18
57. (disembark-truck driver2 truck7 s5)
   deleted: (driving driver2 truck7)
   added: (at driver2 s5) (empty truck7)
   goals met: 13 of 18
58. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 13 of 18
59. (drive-truck truck6 s3 s1 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s1)
   changed: (driven) from 1410 to 1505
   goals met: 13 of 18
60. (disembark-truck driver3 truck6 s1)
   deleted: (driving driver3 truck6)
   added: (at driver3 s1) (empty truck6)
   goals met: 13 of 18
61. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 13 of 18
62. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 13 of 18
63. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 13 of 18
64. (drive-truck truck3 s5 s0 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (driven) from 1505 to 1551
   goals met: 14 of 18
65. (drive-truck truck2 s1 s5 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 1551 to 1579
   goals met: 14 of 18
66. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 14 of 18
67. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 14 of 18
68. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 14 of 18
69. (drive-truck truck2 s5 s1 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (driven) from 1579 to 1607
   goals met: 14 of 18
70. (walk driver2 s0 p0-5)
   deleted: (at driver2 s0)
   added: (at driver2 p0-5)
   changed: (walked) from 120 to 136
   goals met: 14 of 18
71. (walk driver2 p0-5 s5)
   deleted: (at driver2 p0-5)
   added: (at driver2 s5)
   changed: (walked) from 136 to 225
   goals met: 14 of 18
72. (drive-truck truck2 s1 s3 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (driven) from 1607 to 1702
   goals met: 14 of 18
73. (board-truck driver2 truck7 s5)
   deleted: (at driver2 s5) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 14 of 18
74. (drive-truck truck7 s5 s8 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s8)
   changed: (driven) from 1702 to 1737
   goals met: 15 of 18
75. (drive-truck truck2 s3 s5 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (driven) from 1737 to 1783
   goals met: 15 of 18
76. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 15 of 18
77. (drive-truck truck7 s8 s5 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s5)
   changed: (driven) from 1783 to 1818
   goals met: 14 of 18
78. (disembark-truck driver2 truck7 s5)
   deleted: (driving driver2 truck7)
   added: (at driver2 s5) (empty truck7)
   goals met: 14 of 18
79. (board-truck driver3 truck1 s5)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 14 of 18
80. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 14 of 18
81. (drive-truck truck2 s5 s1 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (driven) from 1818 to 1846
   goals met: 14 of 18
82. (disembark-truck driver3 truck1 s5)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 14 of 18
83. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 14 of 18
84. (board-truck driver3 truck1 s5)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 14 of 18
85. (drive-truck truck1 s5 s3 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 1846 to 1892
   goals met: 14 of 18
86. (walk driver2 s1 p1-5)
   deleted: (at driver2 s1)
   added: (at driver2 p1-5)
   changed: (walked) from 225 to 276
   goals met: 14 of 18
87. (walk driver2 p1-5 s5)
   deleted: (at driver2 p1-5)
   added: (at driver2 s5)
   changed: (walked) from 276 to 369
   goals met: 14 of 18
88. (board-truck driver2 truck7 s5)
   deleted: (at driver2 s5) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 14 of 18
89. (drive-truck truck1 s3 s5 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (driven) from 1892 to 1938
   goals met: 14 of 18
90. (drive-truck truck1 s5 s8 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   changed: (driven) from 1938 to 1973
   goals met: 15 of 18
91. (disembark-truck driver3 truck1 s8)
   deleted: (driving driver3 truck1)
   added: (at driver3 s8) (empty truck1)
   goals met: 15 of 18
92. (drive-truck truck7 s5 s8 driver2)
   deleted: (at truck7 s5)
   added: (at truck7 s8)
   changed: (driven) from 1973 to 2008
   goals met: 16 of 18
93. (disembark-truck driver2 truck7 s8)
   deleted: (driving driver2 truck7)
   added: (at driver2 s8) (empty truck7)
   goals met: 16 of 18
94. (walk driver3 s8 p8-7)
   deleted: (at driver3 s8)
   added: (at driver3 p8-7)
   changed: (walked) from 369 to 454
   goals met: 16 of 18
95. (walk driver3 p8-7 s7)
   deleted: (at driver3 p8-7)
   added: (at driver3 s7)
   changed: (walked) from 454 to 466
   goals met: 16 of 18
96. (walk driver3 s7 p7-3)
   deleted: (at driver3 s7)
   added: (at driver3 p7-3)
   changed: (walked) from 466 to 541
   goals met: 16 of 18
97. (walk driver3 p7-3 s3)
   deleted: (at driver3 p7-3)
   added: (at driver3 s3)
   changed: (walked) from 541 to 599
   goals met: 17 of 18
98. (walk driver2 s8 p1-8)
   deleted: (at driver2 s8)
   added: (at driver2 p1-8)
   changed: (walked) from 599 to 678
   goals met: 17 of 18
99. (walk driver2 p1-8 s1)
   deleted: (at driver2 p1-8)
   added: (at driver2 s1)
   changed: (walked) from 678 to 719
   goals met: 17 of 18
100. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 17 of 18
101. (drive-truck truck2 s1 s7 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (driven) from 2008 to 2083
   goals met: 18 of 18
